solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
/*
 * Copyright 2024 NXP
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_xspi_nor_flash.h"
#include "fsl_nor_flash.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define XSPI_INSTR_CMD_IDX   (0U)
#define XSPI_INSTR_RADDR_IDX (1U)
#define XSPI_INSTR_CADDR_IDX (2U)
#define XSPI_INSTR_READ_IDX  (3U)
#define XSPI_INSTR_WRITE_IDX (4U)
#define XSPI_INSTR_MODE_IDX  (5U)
#define XSPI_INSTR_MODE2_IDX (6U)
#define XSPI_INSTR_MODE4_IDX (7U)

const xspi_lut_instr_t g_xspiCommonInstr[2][8] = {
    {kXSPI_Command_SDR, kXSPI_Command_RADDR_SDR, kXSPI_Command_CADDR_SDR, kXSPI_Command_READ_SDR,
     kXSPI_Command_WRITE_SDR, kXSPI_Command_MODE_SDR, kXSPI_Command_MODE2_SDR, kXSPI_Command_MODE4_SDR},
    {kXSPI_Command_DDR, kXSPI_Command_RADDR_DDR, kXSPI_Command_CADDR_DDR, kXSPI_Command_READ_DDR,
     kXSPI_Command_WRITE_DDR, kXSPI_Command_MODE_DDR, kXSPI_Command_MODE2_DDR, kXSPI_Command_MODE4_DDR}};

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
typedef struct _lut_seq_entry
{
    uint32_t insrOperandPair1;
    uint32_t insrOperandPair2;
    uint32_t insrOperandPair3;
    uint32_t insrOperandPair4;
    uint32_t insrOperandPair5;
} lut_seq_entry_t;

typedef struct _lut_seq_instr_operand
{
    uint16_t operand : 8U;
    uint16_t padNum : 2U;
    uint16_t instr : 6U;
} lut_seq_instr_operand_t;
/*******************************************************************************
 * Variables
 ******************************************************************************/

XSPI_Type *curXSPIBase = NULL;
xspi_mem_nor_handle_t xspiMemNorHandle;

static uint32_t s_socXspiAmbaBase[] = XSPI_AMBA_BASES;

lut_seq_entry_t g_xspiLut[16] = {0UL};
/*******************************************************************************
 * Code
 ******************************************************************************/

static status_t XSPI_NOR_ReadSFDP(uint32_t address, uint32_t *buffer, uint32_t bytes)
{
    xspi_transfer_t flashXfer;
    status_t status = kStatus_InvalidArgument;

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    flashXfer.deviceAddress = s_socXspiAmbaBase[xspiInstanceId] + address;
    flashXfer.cmdType       = kXSPI_Read;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READ_SFDP;
    flashXfer.data          = (uint32_t *)(void *)buffer;
    flashXfer.dataSize      = bytes;
    flashXfer.targetGroup   = xspiMemNorHandle.selectedTg; /* Target group selection is from application. */

    status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);

    return status;
}

static status_t XSPI_NOR_ProbeNorFlashSfdpHeader(void)
{
    uint8_t sfdpLutIndex = 0U;
    xspi_device_config_t tmpNorFlashConfig;
    sfdp_protocol_type_t tmpProtocol = kSFDP_Protocol_1s1s1s;
    /* Data strobe used for 4s-4d-4d and 8D-8D-8D. */
    xspi_device_ddr_config_t tmpDeviceDDRConfig;

    struct _probedInfo
    {
        sfdp_protocol_type_t protocolMode;
        uint8_t addrWidth;
    } probedInfo[12] = {
        {kSFDP_Protocol_1s1s1s, 24U}, {kSFDP_Protocol_2s2s2s, 24U}, {kSFDP_Protocol_4s4s4s, 24U},
        {kSFDP_Protocol_4s4d4d, 24U}, {kSFDP_Protocol_8d8d8d, 32U}, {kSFDP_Protocol_8d8d8d, 32U},
        {kSFDP_Protocol_8d8d8d, 24U}, {kSFDP_Protocol_8d8d8d, 24U}, {kSFDP_Protocol_8s8s8s, 32U},
        {kSFDP_Protocol_8s8s8s, 32U}, {kSFDP_Protocol_8s8s8s, 24U}, {kSFDP_Protocol_8s8s8s, 24U},
    };
    /* Read SFDP command can be used with device supported mode if (1s-1s-1s), (2s-2s-2s),
          (4s-4s-4s), (4s-4d-4d) and (8D-8D-8D). For the (8D-8D-8D) mode, the instruction 5Ah and 50 MHz requirements
          remain the same, while 24 or 32 address bit, and a variable number of wait states may be used. */
    lut_seq_entry_t sfdp_lut[12] = {
        /* Read SFDP in 1s-1s-1s mode. */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x5A, kXSPI_Command_RADDR_SDR, kXSPI_1PAD, 24),
            XSPI_LUT_SEQ(kXSPI_Command_DUMMY_SDR, kXSPI_1PAD, 8, kXSPI_Command_READ_SDR, kXSPI_1PAD, 0xFF),
            0UL,
            0UL,
            0UL,
        },

        /* Read SFDP in 2s-2s-2s mode. */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_2PAD, 0x5A, kXSPI_Command_RADDR_SDR, kXSPI_2PAD, 24),
            XSPI_LUT_SEQ(kXSPI_Command_DUMMY_SDR, kXSPI_2PAD, 8, kXSPI_Command_READ_SDR, kXSPI_2PAD, 0xFF),
            0UL,
            0UL,
            0UL,
        },
        /* Read SFDP in 4s-4s-4s mode. */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_4PAD, 0x5A, kXSPI_Command_RADDR_SDR, kXSPI_4PAD, 24),
            XSPI_LUT_SEQ(kXSPI_Command_DUMMY_SDR, kXSPI_4PAD, 8, kXSPI_Command_READ_SDR, kXSPI_4PAD, 0xFF),
            0UL,
            0UL,
            0UL,
        },
        /* Read SFDP in 4s-4d-4d mode. */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_4PAD, 0x5A, kXSPI_Command_RADDR_DDR, kXSPI_4PAD, 24),
            XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_4PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
            0UL,
        },
        /* Read SFDP in 8D-8D-8D mode, with extension is the inverse of the command and 32 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x5AU, kXSPI_Command_DDR, kXSPI_8PAD, 0xA5U),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 32U, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_8PAD, 0xFFU, 0U, 0U, 0U),
            0UL,
            0UL,
        },
        /* Read SFDP in 8D-8D-8D mode, with same extension cmd and 32 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x5A, kXSPI_Command_DDR, kXSPI_8PAD, 0x5A),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 32, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_8PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
        },
        /* Read SFDP in 8D-8D-8D mode, with same extension cmd and 24 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x5A, kXSPI_Command_DDR, kXSPI_8PAD, 0x5A),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 24, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_8PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
        },

        /* Read SFDP in 8D-8D-8D mode, with extension is the inverse of the command and 24 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x5A, kXSPI_Command_DDR, kXSPI_8PAD, 0xA5),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 24, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_8PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
        },
        /* Read SFDP in 8S-8S-8S mode, with extension is the inverse of the command and 32 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_8PAD, 0x5AU, kXSPI_Command_SDR, kXSPI_8PAD, 0xA5U),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_SDR, kXSPI_8PAD, 32U, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_SDR, kXSPI_8PAD, 0xFFU, 0U, 0U, 0U),
            0UL,
            0UL,
        },
        /* Read SFDP in 8S-8S-8S mode, with same extension cmd and 32 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_8PAD, 0x5A, kXSPI_Command_SDR, kXSPI_8PAD, 0x5A),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_SDR, kXSPI_8PAD, 32, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_SDR, kXSPI_8PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
        },
        /* Read SFDP in 8S-8S-8S mode, with same extension cmd and 24 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_8PAD, 0x5A, kXSPI_Command_SDR, kXSPI_8PAD, 0x5A),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_SDR, kXSPI_8PAD, 24, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_SDR, kXSPI_8PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
        },

