solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
        /* Read SFDP in 8S-8S-8S mode, with extension is the inverse of the command and 24 bit address */
        {
            XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_8PAD, 0x5A, kXSPI_Command_SDR, kXSPI_8PAD, 0xA5),
            XSPI_LUT_SEQ(kXSPI_Command_RADDR_SDR, kXSPI_8PAD, 24, kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, 20U),
            XSPI_LUT_SEQ(kXSPI_Command_READ_SDR, kXSPI_8PAD, 0xFF, 0U, 0U, 0U),
            0UL,
            0UL,
        },
    };

    for (sfdpLutIndex = 0U; sfdpLutIndex < ARRAY_SIZE(sfdp_lut); sfdpLutIndex++)
    {
        tmpNorFlashConfig.addrMode                                                = kXSPI_DeviceByteAddressable;
        tmpNorFlashConfig.columnAddrWidth                                         = 0U;
        tmpNorFlashConfig.CSHoldTime                                              = 3U;
        tmpNorFlashConfig.CSSetupTime                                             = 3U;
        tmpNorFlashConfig.deviceInterface                                         = kXSPI_StrandardExtendedSPI;
        tmpNorFlashConfig.enableCASInterleaving                                   = false;
        tmpNorFlashConfig.enableCknPad                                            = false;
        tmpNorFlashConfig.interfaceSettings.strandardExtendedSPISettings.pageSize = 256U;
        tmpNorFlashConfig.ptrDeviceDdrConfig                                      = NULL;
        tmpNorFlashConfig.ptrDeviceRegInfo                                        = NULL;
        tmpNorFlashConfig.sampleClkConfig.dllConfig.dllMode                       = kXSPI_AutoUpdateMode;
        tmpNorFlashConfig.sampleClkConfig.dllConfig.useRefValue                   = true;
        tmpNorFlashConfig.sampleClkConfig.enableDQSLatency                        = false;
        tmpNorFlashConfig.sampleClkConfig.sampleClkSource                         = kXSPI_SampleClkFromDqsPadLoopback;
        tmpNorFlashConfig.deviceSize[0]                                           = 0x40;
        tmpNorFlashConfig.deviceSize[1]                                           = 0x40;
        tmpNorFlashConfig.xspiRootClk = xspiMemNorHandle.clkFreq; /* Set as 50MHz to read SFDP. */

        tmpProtocol = probedInfo[sfdpLutIndex].protocolMode;

        if (((uint32_t)tmpProtocol & 0x100UL) != 0UL)
        {
            tmpDeviceDDRConfig.enableDdr = true;
        }
        else
        {
            tmpDeviceDDRConfig.enableDdr = false;
        }

        if (sfdpLutIndex >= 3U)
        {
            tmpDeviceDDRConfig.enableByteSwapInOctalMode      = false;
            tmpDeviceDDRConfig.ddrDataAlignedClk              = kXSPI_DDRDataAlignedWith2xInternalRefClk;
            tmpNorFlashConfig.sampleClkConfig.sampleClkSource = kXSPI_SampleClkFromExternalDQS;
            tmpNorFlashConfig.ptrDeviceDdrConfig              = &tmpDeviceDDRConfig;
        }

        XSPI_SetDeviceConfig(curXSPIBase, &tmpNorFlashConfig);
        XSPI_EnableModule(curXSPIBase, true);

        XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_READ_SFDP * 5U, &(sfdp_lut[sfdpLutIndex].insrOperandPair1), 5U);

        sfdp_ret_type_t ret;
        ret = SFDP_ReadSFDPHeader(xspiMemNorHandle.ptrSfdpHandle, XSPI_NOR_ReadSFDP);

        if ((ret == kSFDP_RET_Success) && (sfdpLutIndex < ARRAY_SIZE(sfdp_lut)))
        {
            /* successfully to read SFDP header from external device. */

            /* recode current protocol type and address width. */
            xspiMemNorHandle.curProtocolType = probedInfo[sfdpLutIndex].protocolMode;
            xspiMemNorHandle.addrSize        = probedInfo[sfdpLutIndex].addrWidth;
            break;
        }
        else if ((sfdpLutIndex == (ARRAY_SIZE(sfdp_lut) - 1U)) && (ret != kSFDP_RET_Success))
        {
            return kStatus_Fail;
        }
        else
        {
        }
    }

    return kStatus_Success;
}

static status_t XSPI_NOR_Enter4ByteMode(void)
{
    status_t status                             = kStatus_Success;
    sfdp_4_byte_addr_enter_method_t enterMethod = SFDP_Get4ByteAddrModeEnterMethod(xspiMemNorHandle.ptrSfdpHandle);
    uint32_t xspiInstanceId                     = XSPI_GetInstance(curXSPIBase);
    xspi_transfer_t flashXfer;

    switch (enterMethod)
    {
        case kSFDP_4ByteAddrEnterMethod0:
        {
            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0xB7U, kXSPI_Command_STOP, kXSPI_1PAD, 0U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            if (status != kStatus_Success)
            {
                return status;
            }
            break;
        }
        case kSFDP_4ByteAddrEnterMethod1:
        {
            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x06U, kXSPI_Command_SDR, kXSPI_1PAD, 0xB7U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            break;
        }
        case kSFDP_4ByteAddrEnterMethod2:
        {
            break;
        }
        case kSFDP_4ByteAddrEnterMethod3:
        {
            break;
        }
        case kSFDP_4ByteAddrEnterMethod4:
        {
            break;
        }
        case kSFDP_4ByteAddrEnterMethod5:
        {
            /* The flash device support dedicated 4-byte address instruction set, no actions to do. */
            break;
        }
        case kSFDP_4ByteAddrEnterMethod6:
        {
            /* Always operats in 4-byte address mode, no action to do. */
            break;
        }
        default:
        {
            assert(false);
        }
    }

