solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
    return status;
}

static status_t XSPI_NOR_SetNorFlashDeviceConfig(xspi_memory_config_t *ptrUserInputMemConfig)
{
    xspi_device_ddr_config_t externalDeviceDdrConfig;
    xspi_device_status_reg_info_t norFlashStatusRegInfo;
    xspi_device_config_t externNorFlashConfig;
    status_t status;

    externalDeviceDdrConfig.enableDdr                 = SFDP_CheckDTRSupported(xspiMemNorHandle.ptrSfdpHandle);
    externalDeviceDdrConfig.enableByteSwapInOctalMode = SFDP_CheckByteSwapInOctalMode(xspiMemNorHandle.ptrSfdpHandle);
    externalDeviceDdrConfig.ddrDataAlignedClk         = kXSPI_DDRDataAlignedWith2xInternalRefClk;

    sfdp_wip_bit_info_t wipInfo;
    SFDP_GetBusyBitInfo(xspiMemNorHandle.ptrSfdpHandle, (sfdp_flash_pad_num_t)ptrUserInputMemConfig->numPadUsed,
                        &wipInfo);

    norFlashStatusRegInfo.wipLocation           = wipInfo.location;
    norFlashStatusRegInfo.value1Expired         = wipInfo.polarity;
    norFlashStatusRegInfo.upperHalfWordSelected = wipInfo.upperHalfWordSelected;

    (void)memset((void *)(uint32_t)&externNorFlashConfig, 0UL, sizeof(externNorFlashConfig));

    externNorFlashConfig.ptrDeviceRegInfo   = &norFlashStatusRegInfo;
    externNorFlashConfig.deviceSize[0]      = SFDP_GetFlashDensity(xspiMemNorHandle.ptrSfdpHandle);
    externNorFlashConfig.deviceSize[1]      = externNorFlashConfig.deviceSize[0];
    externNorFlashConfig.ptrDeviceDdrConfig = &externalDeviceDdrConfig;
    externNorFlashConfig.enableCknPad       = ptrUserInputMemConfig->enableClknPad;
    externNorFlashConfig.deviceInterface    = kXSPI_StrandardExtendedSPI;
    externNorFlashConfig.interfaceSettings.strandardExtendedSPISettings.pageSize =
        SFDP_GetPageSize(xspiMemNorHandle.ptrSfdpHandle);
    externNorFlashConfig.addrMode              = ptrUserInputMemConfig->addrMode;
    externNorFlashConfig.columnAddrWidth       = 0U;
    externNorFlashConfig.CSHoldTime            = 3U;
    externNorFlashConfig.CSSetupTime           = 3U;
    externNorFlashConfig.enableCASInterleaving = false;
    externNorFlashConfig.sampleClkConfig       = ptrUserInputMemConfig->sampleClkConfig;
    externNorFlashConfig.xspiRootClk           = ptrUserInputMemConfig->xspiRootClk;

    status = XSPI_SetDeviceConfig(curXSPIBase, &externNorFlashConfig);

    xspiMemNorHandle.memSizeInByte         = externNorFlashConfig.deviceSize[0] * 1024UL;
    xspiMemNorHandle.norFlashStatusRegInfo = norFlashStatusRegInfo;

    return status;
}

static void XSPI_NOR_FillPageProgramLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t raddrInstr;
    xspi_lut_instr_t writeInstr;

    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    raddrInstr = g_xspiCommonInstr[addrDDR][XSPI_INSTR_RADDR_IDX];
    writeInstr = g_xspiCommonInstr[dataDDR][XSPI_INSTR_WRITE_IDX];

    sfdp_page_program_cmd_info_t pageProgramCmdInfo;

    SFDP_GetPageProgramCmdInfo(xspiMemNorHandle.ptrSfdpHandle, xspiMemNorHandle.curProtocolType, &pageProgramCmdInfo);

    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t cmdInstrExtension =
            SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, pageProgramCmdInfo.instruction);

        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, (xspi_pad_t)instrPad, pageProgramCmdInfo.instruction, cmdInstr, (xspi_pad_t)instrPad,
                         cmdInstrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM].insrOperandPair2 = XSPI_LUT_SEQ(
            raddrInstr, (xspi_pad_t)addrPad, xspiMemNorHandle.addrSize, writeInstr, (xspi_pad_t)dataPad, 0x8U);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, (xspi_pad_t)instrPad, pageProgramCmdInfo.instruction, raddrInstr,
                         (xspi_pad_t)addrPad, xspiMemNorHandle.addrSize);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM].insrOperandPair2 =
            XSPI_LUT_SEQ(writeInstr, (xspi_pad_t)dataPad, 0x8U, 0x0U, 0x0U, 0x0U);
    }
}

static void XSPI_NOR_FillSectorEraseLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t raddrInstr;
    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    raddrInstr = g_xspiCommonInstr[addrDDR][XSPI_INSTR_RADDR_IDX];

    sfdp_erase_cmd_info_t sectorEraseCmdInfo;

    if (SFDP_GetSectorEraseCmdInfo(xspiMemNorHandle.ptrSfdpHandle, kSFDP_EraseCmdType1, &sectorEraseCmdInfo) ==
        kSFDP_RET_Success)
    {
        if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
        {
            uint8_t cmdInstrExtension =
                SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, sectorEraseCmdInfo.instruction);

            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASESECTOR].insrOperandPair1 =
                XSPI_LUT_SEQ(cmdInstr, instrPad, sectorEraseCmdInfo.instruction, cmdInstr, instrPad, cmdInstrExtension);
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASESECTOR].insrOperandPair2 =
                XSPI_LUT_SEQ(raddrInstr, addrPad, xspiMemNorHandle.addrSize, kXSPI_Command_STOP, instrPad, 0U);
        }
        else
        {
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASESECTOR].insrOperandPair1 = XSPI_LUT_SEQ(
                cmdInstr, instrPad, sectorEraseCmdInfo.instruction, raddrInstr, addrPad, xspiMemNorHandle.addrSize);
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASESECTOR].insrOperandPair2 =
                XSPI_LUT_SEQ(kXSPI_Command_STOP, instrPad, 0x0U, 0x0U, 0x0U, 0x0U);
        }
    }

    xspiMemNorHandle.sectorSizeInByte = sectorEraseCmdInfo.eraseSize;
    (void)dataPad;
    (void)dataDDR;
}

