solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
static void XSPI_NOR_FillBlockEraseLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t raddrInstr;
    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    raddrInstr = g_xspiCommonInstr[addrDDR][XSPI_INSTR_RADDR_IDX];

    sfdp_erase_cmd_info_t sectorEraseCmdInfo;

    if (SFDP_GetSectorEraseCmdInfo(xspiMemNorHandle.ptrSfdpHandle, kSFDP_EraseCmdType2, &sectorEraseCmdInfo) ==
        kSFDP_RET_Success)
    {
        if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
        {
            uint8_t cmdInstrExtension =
                SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, sectorEraseCmdInfo.instruction);
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK].insrOperandPair1 =
                XSPI_LUT_SEQ(cmdInstr, instrPad, sectorEraseCmdInfo.instruction, cmdInstr, instrPad, cmdInstrExtension);
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK].insrOperandPair2 =
                XSPI_LUT_SEQ(raddrInstr, addrPad, xspiMemNorHandle.addrSize, kXSPI_Command_STOP, instrPad, 0U);
        }
        else
        {
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK].insrOperandPair1 = XSPI_LUT_SEQ(
                cmdInstr, instrPad, sectorEraseCmdInfo.instruction, raddrInstr, addrPad, xspiMemNorHandle.addrSize);

            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK].insrOperandPair2 =
                XSPI_LUT_SEQ(kXSPI_Command_STOP, instrPad, 0x0U, 0x0U, 0x0U, 0x0U);
        }
    }

    (void)dataPad;
    (void)dataDDR;
}

static void XSPI_NOR_FillWriteEnableLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);
    (void)addrPad;
    (void)addrDDR;
    (void)dataPad;
    (void)dataDDR;

    cmdInstr = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];

    uint8_t wrenInstr = 0x06U;
    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t wrenInstrExtension = SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, wrenInstr);

        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_WRITEENABLE].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, wrenInstr, cmdInstr, instrPad, wrenInstrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_WRITEENABLE].insrOperandPair2 =
            XSPI_LUT_SEQ(kXSPI_Command_STOP, instrPad, 0x0U, 0x0U, 0x0U, 0x0U);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_WRITEENABLE].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, wrenInstr, kXSPI_Command_STOP, instrPad, 0x0U);
    }
}

static void XSPI_NOR_FillReadIdLutSeq(void)
{
    uint8_t readIdInstr = 0x9F;
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t readInstr;
    xspi_lut_instr_t raddrInstr;

    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    readInstr  = g_xspiCommonInstr[dataDDR][XSPI_INSTR_READ_IDX];
    raddrInstr = g_xspiCommonInstr[addrDDR][XSPI_INSTR_RADDR_IDX];

    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t instrExtension = SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, readIdInstr);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READID].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, readIdInstr, cmdInstr, instrPad, instrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READID].insrOperandPair2 =
            XSPI_LUT_SEQ(raddrInstr, addrPad, xspiMemNorHandle.addrSize, kXSPI_Command_DUMMY_SDR, instrPad, 0x4U);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READID].insrOperandPair3 =
            XSPI_LUT_SEQ(readInstr, dataPad, 0x08U, kXSPI_Command_STOP, kXSPI_1PAD, 0x0U);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READID].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, readIdInstr, raddrInstr, addrPad, xspiMemNorHandle.addrSize);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READID].insrOperandPair2 =
            XSPI_LUT_SEQ(kXSPI_Command_DUMMY_SDR, instrPad, 0x4U, readInstr, dataPad, 0x08U);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READID].insrOperandPair3 =
            XSPI_LUT_SEQ(kXSPI_Command_STOP, kXSPI_1PAD, 0x0U, 0x0U, 0x0U, 0x0U);
    }
}

static void XSPI_NOR_FillReadDataLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t readInstr;
    xspi_lut_instr_t raddrInstr;

    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    readInstr  = g_xspiCommonInstr[dataDDR][XSPI_INSTR_READ_IDX];
    raddrInstr = g_xspiCommonInstr[addrDDR][XSPI_INSTR_RADDR_IDX];

    sfdp_read_cmd_info_t readCmdInfo;
    uint32_t clkFreq = xspiMemNorHandle.clkFreq;

    if (SFDP_CheckDTRSupported(xspiMemNorHandle.ptrSfdpHandle) == true)
    {
        clkFreq /= 2UL;
    }

    SFDP_GetReadCmdInfo(xspiMemNorHandle.ptrSfdpHandle, xspiMemNorHandle.curProtocolType, clkFreq, &readCmdInfo);

    /* @TODO: In case of dummy cycle is updated in ROM, read register to check current dummy cycle value. */

    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t instrExtension = SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, readCmdInfo.instruction);

        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READ].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, readCmdInfo.instruction, cmdInstr, instrPad, instrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READ].insrOperandPair2 = XSPI_LUT_SEQ(
            raddrInstr, addrPad, xspiMemNorHandle.addrSize, kXSPI_Command_DUMMY_SDR, instrPad, readCmdInfo.dummyCycle);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READ].insrOperandPair3 =
            XSPI_LUT_SEQ(readInstr, dataPad, 0x8U, kXSPI_Command_STOP, instrPad, 0U);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READ].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, readCmdInfo.instruction, raddrInstr, addrPad, xspiMemNorHandle.addrSize);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READ].insrOperandPair2 =
            XSPI_LUT_SEQ(kXSPI_Command_DUMMY_SDR, instrPad, readCmdInfo.dummyCycle, readInstr, dataPad, 0x8U);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READ].insrOperandPair3 =
            XSPI_LUT_SEQ(kXSPI_Command_STOP, instrPad, 0U, 0U, 0U, 0U);
    }
}

static void XSPI_NOR_FillChipEraseLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;

    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);
    (void)addrDDR;
    (void)addrPad;
    (void)dataPad;
    (void)dataDDR;

    cmdInstr = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    sfdp_chip_erase_cmd_info_t chipEraseCmdInfo;

    SFDP_GetChipEraseCmdInfo(xspiMemNorHandle.ptrSfdpHandle, &chipEraseCmdInfo);
    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t instrExtension =
            SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, chipEraseCmdInfo.instruction);

