solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_CHIPERASE].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, chipEraseCmdInfo.instruction, cmdInstr, instrPad, instrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_CHIPERASE].insrOperandPair2 =
            XSPI_LUT_SEQ(kXSPI_Command_STOP, instrPad, 0U, 0U, 0U, 0U);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_CHIPERASE].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, chipEraseCmdInfo.instruction, kXSPI_Command_STOP, instrPad, 0U);
    }
}

static void XSPI_NOR_FillReadStatusLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t raddrInstr;
    xspi_lut_instr_t readInstr;

    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    raddrInstr = g_xspiCommonInstr[addrDDR][XSPI_INSTR_RADDR_IDX];
    readInstr  = g_xspiCommonInstr[dataDDR][XSPI_INSTR_READ_IDX];

    sfdp_read_status_cmd_info_t readStatusCmdInfo;
    SFDP_GetReadStatusCmdInfo(xspiMemNorHandle.ptrSfdpHandle, xspiMemNorHandle.curProtocolType, &readStatusCmdInfo);

    /* @TODO: In case of dummy cycle is updated. */

    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t instrExtension =
            SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, readStatusCmdInfo.instruction);

        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, readStatusCmdInfo.instruction, cmdInstr, instrPad, instrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair2 =
            XSPI_LUT_SEQ(raddrInstr, addrPad, readStatusCmdInfo.addrSize, kXSPI_Command_DUMMY_SDR, instrPad,
                         readStatusCmdInfo.dummyCycle);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair3 =
            XSPI_LUT_SEQ(readInstr, dataPad, 0x4, kXSPI_Command_STOP, instrPad, 0x0U);
    }
    else if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_1s1s1s)
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, readStatusCmdInfo.instruction, readInstr, dataPad, 0x8);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair1 = XSPI_LUT_SEQ(
            cmdInstr, instrPad, readStatusCmdInfo.instruction, raddrInstr, addrPad, readStatusCmdInfo.addrSize);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair2 =
            XSPI_LUT_SEQ(kXSPI_Command_DUMMY_SDR, instrPad, readStatusCmdInfo.dummyCycle, readInstr, dataPad, 0x8);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_READSTATUS].insrOperandPair3 =
            XSPI_LUT_SEQ(kXSPI_Command_STOP, instrPad, 0x0U, 0x0U, 0x0U, 0x0U);
    }
}

static void XSPI_NOR_FillWriteStatusLutSeq(void)
{
    xspi_lut_instr_t cmdInstr;
    xspi_lut_instr_t writeInstr;

    sfdp_flash_pad_num_t instrPad;
    uint8_t instrDDR;
    sfdp_flash_pad_num_t addrPad;
    uint8_t addrDDR;
    sfdp_flash_pad_num_t dataPad;
    uint8_t dataDDR;

    SFDP_DECODE_PROTOCOL_TYPE(xspiMemNorHandle.curProtocolType);

    cmdInstr   = g_xspiCommonInstr[instrDDR][XSPI_INSTR_CMD_IDX];
    writeInstr = g_xspiCommonInstr[dataDDR][XSPI_INSTR_WRITE_IDX];

    (void)addrPad;
    (void)addrDDR;

    sfdp_write_status_cmd_info_t writeStatusCmdInfo;
    SFDP_GetWriteStatusCmdInfo(xspiMemNorHandle.ptrSfdpHandle, &writeStatusCmdInfo);

    if (xspiMemNorHandle.curProtocolType == kSFDP_Protocol_8d8d8d)
    {
        uint8_t instrExtension =
            SFDP_GetOctalDTRCmdExtension(xspiMemNorHandle.ptrSfdpHandle, writeStatusCmdInfo.instruction);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, writeStatusCmdInfo.instruction, cmdInstr, instrPad, instrExtension);
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS].insrOperandPair2 =
            XSPI_LUT_SEQ(writeInstr, dataPad, 0x4U, kXSPI_Command_STOP, instrPad, 0x0U);
    }
    else
    {
        g_xspiLut[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS].insrOperandPair1 =
            XSPI_LUT_SEQ(cmdInstr, instrPad, writeStatusCmdInfo.instruction, writeInstr, dataPad, 0x4U);
    }
}

static status_t XSPI_NOR_UpdateLut(nor_handle_t *handle, xspi_memory_config_t *ptrUserInputMemConfig)
{
    /* If user input customized LUT use directly, else fill LUT from SFDP. */
    if (ptrUserInputMemConfig->ptrCustomLut == NULL)
    {
        XSPI_NOR_FillReadDataLutSeq();
        XSPI_NOR_FillReadStatusLutSeq();
        XSPI_NOR_FillWriteStatusLutSeq();
        XSPI_NOR_FillWriteEnableLutSeq();
        XSPI_NOR_FillSectorEraseLutSeq();
        XSPI_NOR_FillReadIdLutSeq();
        XSPI_NOR_FillPageProgramLutSeq();
        XSPI_NOR_FillChipEraseLutSeq();
        XSPI_NOR_FillBlockEraseLutSeq();
    }
    else
    {
        memcpy((void *)g_xspiLut, (void *)(ptrUserInputMemConfig->ptrCustomLut), 80U * 4U);
    }

    XSPI_UpdateLUT(curXSPIBase, 0U, (uint32_t const *)&g_xspiLut, 80U);

    return kStatus_Success;
}

static status_t XSPI_NOR_WriteEnable(nor_handle_t *handle, uint32_t address)
{
    xspi_transfer_t flashXfer;
    status_t status = kStatus_InvalidArgument;

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    if (address >= s_socXspiAmbaBase[xspiInstanceId])
    {
        flashXfer.deviceAddress = address;
    }
    else
    {
        flashXfer.deviceAddress = s_socXspiAmbaBase[xspiInstanceId] + address;
    }
    flashXfer.cmdType         = kXSPI_Command;
    flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_WRITEENABLE;
    flashXfer.data            = NULL;
    flashXfer.dataSize        = 0UL;
    flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;
    flashXfer.lockArbitration = false;

    status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);

