solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
    return status;
}

sfdp_protocol_type_t XSPI_NOR_FindProtocolType(xspi_memory_config_t *ptrXspiMemConfig)
{
    sfdp_protocol_type_t calculatedProtocolType;
    sfdp_cmd_policy_t policy           = kSFDP_CmdPolicy_HighestThroughput;
    sfdp_ret_type_t ret                = kSFDP_RET_Success;
    sfdp_xspi_profile_opi_cmd_t opiCmd = kSFDP_OPICmd_Erase4K;

    while ((uint8_t)policy < SFDP_CMD_POLICY_COUNT)
    {
        calculatedProtocolType = SFDP_GetFlashProtocolType(xspiMemNorHandle.ptrSfdpHandle, policy,
                                                           (sfdp_flash_pad_num_t)(ptrXspiMemConfig->numPadUsed));

        if (calculatedProtocolType == kSFDP_Protocol_8d8d8d)
        {
            do
            {
                ret = SFDP_CheckOPICmdSupported(xspiMemNorHandle.ptrSfdpHandle, opiCmd);
                opiCmd++;
            } while ((ret == kSFDP_RET_Success) && ((uint8_t)opiCmd < SFDP_XSPI_PROFILE_OPI_CMD_COUNT));

            if (ret != kSFDP_RET_Success)
            {
                policy++;
            }
            else
            {
                break;
            }
        }
        else
        {
            break;
        }
    }

    return calculatedProtocolType;
}

static status_t XSPI_NOR_QuadEnable(void)
{
    status_t status                            = kStatus_Success;
    sfdp_quad_enable_method_t quadEnableMethod = SFDP_GetQuadEnableMethod(xspiMemNorHandle.ptrSfdpHandle);

    switch (quadEnableMethod)
    {
        case kSFDP_QuadEnableNotSupported:
        {
            /*Device doest not have a QE bit, device detects 1s-1s-4s and 1s-4s-4s reads based on instruction.  */
            break;
        }
        case kSFDP_QuadEnableMethod1:
        {
            break;
        }
        case kSFDP_QuadEnableMethod2:
        {
            break;
        }
        case kSFDP_QuadEnableMethod3:
        {
            break;
        }
        case kSFDP_QuadEnableMethod4:
        {
            break;
        }
        case kSFDP_QuadEnableMethod5:
        {
            break;
        }
        case kSFDP_QuadEnableMethod6:
        {
            break;
        }
        default:
        {
            assert(false);
        }
    }

    return status;
}

static status_t XSPI_NOR_EnterQuadSSRMode(void)
{
    status_t status                               = kStatus_Success;
    sfdp_4s4s4s_mode_enable_method_t enableMethod = SFDP_Get4s4s4sModeEnableMethod(xspiMemNorHandle.ptrSfdpHandle);
    uint32_t xspiInstanceId                       = XSPI_GetInstance(curXSPIBase);
    xspi_transfer_t flashXfer;

    switch (enableMethod)
    {
        case kSFDP_4s4s4sModeEnableMethod0:
        {
            XSPI_NOR_QuadEnable();

            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x38U, kXSPI_Command_STOP, kXSPI_1PAD, 0U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            if (status != kStatus_Success)
            {
                return status;
            }
            break;
        }
        case kSFDP_4s4s4sModeEnableMethod1:
        {
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x38U, kXSPI_Command_STOP, kXSPI_1PAD, 0U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            if (status != kStatus_Success)
            {
                return status;
            }
            break;
        }
        case kSFDP_4s4s4sModeEnableMethod2:
        {
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x35U, kXSPI_Command_STOP, kXSPI_1PAD, 0U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            if (status != kStatus_Success)
            {
                return status;
            }
            break;
        }
        case kSFDP_4s4s4sModeEnableMethod3:
        {
            /*!< Read configuration using instruction 65h followed by address 800003h,
                set bit 6, write configuration using instruction 71h followed by
                address 800003h. */
            break;
        }
        case kSFDP_4s4s4sModeEnableMethod4:
        {
            /*!< Read volatile enhanced configuration using instruction 65h, no
                address is required, set bit 7 to 1, write volatile enhanced
                configuration using instruction 61h, no address is required. */
            break;
        }
    }

