solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
    return status;
}

static status_t XSPI_NOR_EnterQuadDDRMode(void)
{
    status_t status = kStatus_Success;
    sfdp_4s4d4d_entry_seq_t quadEntrySeq;

    if (SFDP_Get4s4d4dEntrySeq(xspiMemNorHandle.ptrSfdpHandle, &quadEntrySeq) != kSFDP_RET_Success)
    {
        return kStatus_Fail;
    }

    uint8_t seqLength = 0U;
    uint32_t i        = 0U;
    lut_seq_instr_operand_t altSeq[10];
    xspi_transfer_t flashXfer;
    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);
    uint32_t delayCount     = 0UL;

    sfdp_entry_seq_format_t *ptrSeq = &(quadEntrySeq.seq1);
    for (uint8_t seqId = 0U; seqId < 4U; seqId++)
    {
        if (ptrSeq->seqStruct.length != 0U)
        {
            seqLength = ptrSeq->seqStruct.length;
            memset(altSeq, 0UL, sizeof(altSeq));
            for (i = 0U; i < seqLength; i++)
            {
                altSeq[i].operand = SFDP_GET_SEQ_CMD((*ptrSeq), i + 1U);
                altSeq[i].instr   = kXSPI_Command_SDR;
                altSeq[i].padNum  = kXSPI_1PAD;
            }
            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            memcpy((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, (void *)&altSeq[0],
                   seqLength * sizeof(altSeq));

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            __ISB();
            __DSB();
            for (delayCount = 0U; delayCount < 2000U; delayCount++)
            {
                /* Delay to make sure command effect. */
                __NOP();
            }
        }
        if (status != kStatus_Success)
        {
            break;
        }
        ptrSeq++;
    }

    return status;
}

static status_t XSPI_NOR_OctalEnable(void)
{
    status_t status                              = kStatus_Success;
    sfdp_octal_enable_method_t octalEnableMethod = SFDP_GetOctalEnableMethod(xspiMemNorHandle.ptrSfdpHandle);

    switch (octalEnableMethod)
    {
        case kSFDP_OctalEnableNotSupported:
        {
            /* Not supported. */
            break;
        }
        case kSFDP_OctalEnableMethod1:
        {
            /*!< Octal enable is bit 3 of status register, it is set via write status register2
            instruction 31h with one data byte where bit 3 is one, it is cleared via write
            register instruction 3Eh with one data byte where bit 3 is zero, the status
            register 2 is read using instruction 65h with address byte 02h and one dummy
            cycle. */
            break;
        }
        default:
        {
            assert(false);
        }
    }

    return status;
}

static status_t XSPI_NOR_EnterOctalSSRMode(void)
{
    status_t status                               = kStatus_Success;
    sfdp_8s8s8s_mode_enable_method_t enableMethod = SFDP_Get8s8s8sModeEnableMethod(xspiMemNorHandle.ptrSfdpHandle);
    uint32_t xspiInstanceId                       = XSPI_GetInstance(curXSPIBase);
    xspi_transfer_t flashXfer;

    switch (enableMethod)
    {
        case kSFDP_8s8s8sModeEnableMethod0:
        {
            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x06U, kXSPI_Command_SDR, kXSPI_1PAD, 0xE8U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            break;
        }
        case kSFDP_8s8s8sModeEnableMethod1:
        {
            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1 =
                XSPI_LUT_SEQ(kXSPI_Command_SDR, kXSPI_1PAD, 0x06U, kXSPI_Command_SDR, kXSPI_1PAD, 0x72U);

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            break;
        }
        default:
        {
            assert(false);
        }
    }

    return status;
}

static status_t XSPI_NOR_EnterOctalDDRMode(void)
{
    sfdp_8d8d8d_entry_seq_t octalEntrySeq;
    status_t status = kStatus_Success;

    if (SFDP_Get8d8d8dEntrySeq(xspiMemNorHandle.ptrSfdpHandle, &octalEntrySeq) != kSFDP_RET_Success)
    {
        return kStatus_Fail;
    }
    uint8_t seqLength = 0U;
    uint32_t i        = 0U;
    lut_seq_instr_operand_t altSeq[10];
    xspi_transfer_t flashXfer;
    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);
    uint32_t delayCount     = 0UL;

