solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
    sfdp_entry_seq_format_t *ptrSeq = &(octalEntrySeq.seq1);
    for (uint8_t seqId = 0U; seqId < 4U; seqId++)
    {
        if (ptrSeq->seqStruct.length != 0U)
        {
            seqLength = ptrSeq->seqStruct.length;
            memset(altSeq, 0UL, sizeof(altSeq));
            for (i = 0U; i < seqLength; i++)
            {
                altSeq[i].operand = SFDP_GET_SEQ_CMD((*ptrSeq), i + 1U);
                altSeq[i].instr   = kXSPI_Command_SDR;
                altSeq[i].padNum  = kXSPI_1PAD;
            }
            memset((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, 0UL, sizeof(lut_seq_entry_t));
            memcpy((void *)&g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1, (void *)&altSeq[0], sizeof(altSeq));

            XSPI_UpdateLUT(curXSPIBase, NOR_CMD_LUT_SEQ_IDX_ALT * 5U,
                           &(g_xspiLut[NOR_CMD_LUT_SEQ_IDX_ALT].insrOperandPair1), 5U);

            flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
            flashXfer.cmdType         = kXSPI_Command;
            flashXfer.data            = NULL;
            flashXfer.dataSize        = 0U;
            flashXfer.lockArbitration = false;
            flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ALT;
            flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;

            status = XSPI_TransferBlocking(curXSPIBase, &flashXfer);
            __ISB();
            __DSB();
            for (delayCount = 0U; delayCount < 2000U; delayCount++)
            {
                /* Delay to make sure command effect. */
                __NOP();
            }
        }
        if (status != kStatus_Success)
        {
            break;
        }
        ptrSeq++;
    }

    return status;
}

status_t Nor_Flash_Init(nor_config_t *config, nor_handle_t *handle)
{
    assert(config != NULL);

    xspi_memory_config_t xspiNorMemConfig = *(xspi_memory_config_t *)(config->memControlConfig);

    xspiMemNorHandle.selectedTg = xspiNorMemConfig.tgId;
    xspiMemNorHandle.clkFreq    = xspiNorMemConfig.xspiRootClk;

    xspi_ahb_write_config_t xspiAhbWriteConfig;
    xspi_ahb_access_config_t xspiAhbAccessConfig;
    xspi_ip_access_config_t xspiIpAccessConfig;
    xspi_config_t xspiConfig;

    curXSPIBase = (XSPI_Type *)(uint32_t)(config->driverBaseAddr);
    XSPI_ResetSfmAndAhbDomain(curXSPIBase);

    XSPI_UpdateByteOrder(curXSPIBase, kXSPI_32BitLE);

    sfdp_handle_t sfdpHandle;
    (void)memset((void *)&sfdpHandle, 0UL, sizeof(sfdpHandle));

    xspiMemNorHandle.ptrSfdpHandle = &sfdpHandle;

    xspiConfig.enableDoze         = xspiNorMemConfig.enableXspiDoze;
    xspiConfig.ptrAhbAccessConfig = &xspiAhbAccessConfig;
    xspiConfig.ptrIpAccessConfig  = &xspiIpAccessConfig;
    XSPI_GetDefaultConfig(&xspiConfig);

    if (xspiNorMemConfig.ptrXspiNorAhbAccessConfig != NULL)
    {
        /* In case of user customized AHB access configurations, overwrite the default settings.  */
        xspiAhbAccessConfig.buffer[0]         = xspiNorMemConfig.ptrXspiNorAhbAccessConfig->ahbBuffer0Config;
        xspiAhbAccessConfig.buffer[1]         = xspiNorMemConfig.ptrXspiNorAhbAccessConfig->ahbBuffer1Config;
        xspiAhbAccessConfig.buffer[2]         = xspiNorMemConfig.ptrXspiNorAhbAccessConfig->ahbBuffer2Config;
        xspiAhbAccessConfig.buffer[3]         = xspiNorMemConfig.ptrXspiNorAhbAccessConfig->ahbBuffer3Config;
        xspiAhbAccessConfig.enableAHBPrefetch = xspiNorMemConfig.ptrXspiNorAhbAccessConfig->enablePrefetch;
        if (xspiNorMemConfig.ptrXspiNorAhbAccessConfig->enableAhbWrite)
        {
            xspiAhbAccessConfig.ptrAhbWriteConfig = &xspiAhbWriteConfig;
        }
        else
        {
            xspiAhbAccessConfig.ptrAhbWriteConfig = NULL;
        }
    }

    xspiAhbAccessConfig.ahbAlignment                = kXSPI_AhbAlignmentNoLimit;
    xspiAhbAccessConfig.ahbErrorPayload.highPayload = 0x5A5A5A5AUL; /* hard code in component. */
    xspiAhbAccessConfig.ahbErrorPayload.lowPayload  = 0x5A5A5A5AUL; /* hard code in component. */
    xspiAhbAccessConfig.ahbSplitSize                = kXSPI_AhbSplitSizeDisabled;
    xspiAhbAccessConfig.ARDSeqIndex                 = NOR_CMD_LUT_SEQ_IDX_READ;

    xspiAhbAccessConfig.enableAHBBufferWriteFlush = true;

    if (xspiNorMemConfig.ptrXspiNorIPAccessConfig != NULL)
    {
        /* In case of user customized IP access configurations, overwrite the default settings.  */
        xspiIpAccessConfig.ipAccessTimeoutValue = xspiNorMemConfig.ptrXspiNorIPAccessConfig->ipAccessTimeoutValue;
        xspiIpAccessConfig.ptrSfpFradConfig     = xspiNorMemConfig.ptrXspiNorIPAccessConfig->ptrSfpFradConfig;
        xspiIpAccessConfig.ptrSfpMdadConfig     = xspiNorMemConfig.ptrXspiNorIPAccessConfig->ptrSfpMdadConfig;
        xspiIpAccessConfig.sfpArbitrationLockTimeoutValue =
            xspiNorMemConfig.ptrXspiNorIPAccessConfig->sfpArbitrationLockTimeoutValue;
    }

    /* initialize host controller. */
    XSPI_Init(curXSPIBase, &xspiConfig);

    if (XSPI_NOR_ProbeNorFlashSfdpHeader() != kStatus_Success)
    {
        return kStatus_Fail;
    }

    if (SFDP_ReadAllSupportedTable(&sfdpHandle) != kSFDP_RET_Success)
    {
        return kStatus_Fail;
    }

    if ((SFDP_GetAddressBytes(&sfdpHandle) != kSFDP_AddrMode_3ByteOnly) && (xspiMemNorHandle.addrSize != 32U))
    {
        XSPI_NOR_Enter4ByteMode();
        xspiMemNorHandle.addrSize = 32U;
    }

    sfdp_protocol_type_t targetProtocolType = XSPI_NOR_FindProtocolType(&xspiNorMemConfig);

    if ((targetProtocolType >= kSFDP_Protocol_1s1s4s) && (targetProtocolType <= kSFDP_Protocol_4s4d4d))
    {
        if (targetProtocolType <= kSFDP_Protocol_1s4d4d)
        {
            if (XSPI_NOR_QuadEnable() != kStatus_Success)
            {
                return kStatus_Fail;
            }
        }
        else if (targetProtocolType == kSFDP_Protocol_4s4s4s)
        {
            if (XSPI_NOR_EnterQuadSSRMode() != kStatus_Success)
            {
                return kStatus_Fail;
            }
        }
        else
        {
            if (XSPI_NOR_EnterQuadDDRMode() != kStatus_Success)
            {
                return kStatus_Fail;
            }
        }
    }
    if (targetProtocolType >= kSFDP_Protocol_1s1s8s)
    {
        if (targetProtocolType <= kSFDP_Protocol_1s8d8d)
        {
            if (XSPI_NOR_OctalEnable() != kStatus_Success)
            {
                return kStatus_Fail;
            }
        }
        else if (targetProtocolType == kSFDP_Protocol_8s8s8s)
        {
            if (XSPI_NOR_EnterOctalSSRMode() != kStatus_Success)
            {
                return kStatus_Fail;
            }
        }
        else
        {
            if (XSPI_NOR_EnterOctalDDRMode() != kStatus_Success)
            {
                return kStatus_Fail;
            }
        }
    }

