solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
    xspiMemNorHandle.curProtocolType = targetProtocolType;

    if (XSPI_NOR_SetNorFlashDeviceConfig(&xspiNorMemConfig) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    if (XSPI_NOR_UpdateLut(handle, &xspiNorMemConfig) != kStatus_Success)
    {
        return kStatus_Fail;
    }
    /* Update handle for other interfaces. */
    handle->driverBaseAddr    = config->driverBaseAddr;
    handle->deviceSpecific    = (void *)(uint32_t)(&xspiMemNorHandle);
    handle->bytesInSectorSize = xspiMemNorHandle.sectorSizeInByte;
    handle->bytesInMemorySize = xspiMemNorHandle.memSizeInByte;
    handle->bytesInPageSize   = SFDP_GetPageSize(&sfdpHandle);

    return kStatus_Success;
}

status_t Nor_Flash_Read(nor_handle_t *handle, uint32_t address, uint8_t *buffer, uint32_t length)
{
    assert(handle != NULL);
    assert(buffer != NULL);

    xspi_transfer_t flashXfer;
    status_t status                            = kStatus_Success;
    xspi_mem_nor_handle_t *ptrXspiMemNorHandle = (xspi_mem_nor_handle_t *)(uint32_t)(handle->deviceSpecific);

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    if (address >= s_socXspiAmbaBase[xspiInstanceId])
    {
        flashXfer.deviceAddress = address;
    }
    else
    {
        flashXfer.deviceAddress = s_socXspiAmbaBase[xspiInstanceId] + address;
    }
    flashXfer.cmdType  = kXSPI_Read;
    flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_READ; /* Hard code as 0, the first sequence of LUT is used to read
                                                   data from Flash device. */
    flashXfer.data            = (uint32_t *)(void *)buffer;
    flashXfer.dataSize        = length;
    flashXfer.targetGroup     = ptrXspiMemNorHandle->selectedTg; /* Target group selection is from application. */
    flashXfer.lockArbitration = false;

    status = XSPI_TransferBlocking((XSPI_Type *)handle->driverBaseAddr, &flashXfer);

    return status;
}

status_t Nor_Flash_Page_Program(nor_handle_t *handle, uint32_t address, uint8_t *buffer)
{
    assert(handle != NULL);
    assert(buffer != NULL);

    xspi_transfer_t flashXfer;
    status_t status = kStatus_Success;
    bool isBusy     = true;

    /* Write Enable. */
    if (XSPI_NOR_WriteEnable(handle, address) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    if (address >= s_socXspiAmbaBase[xspiInstanceId])
    {
        flashXfer.deviceAddress = address;
    }
    else
    {
        flashXfer.deviceAddress = s_socXspiAmbaBase[xspiInstanceId] + address;
    }
    flashXfer.cmdType         = kXSPI_Write;
    flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM;
    flashXfer.data            = (uint32_t *)(void *)buffer;
    flashXfer.dataSize        = handle->bytesInPageSize;
    flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;
    flashXfer.lockArbitration = true;

    status = XSPI_TransferBlocking((XSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (status == kStatus_Success)
    {
        /* Loop until WIP is cleared  */
        do
        {
            (void)Nor_Flash_Is_Busy(handle, &isBusy);
        } while (isBusy == true);
    }

    return status;
}

status_t Nor_Flash_Program(nor_handle_t *handle, uint32_t address, uint8_t *buffer, uint32_t length)
{
    assert(handle != NULL);
    assert(buffer != NULL);

    assert(handle != NULL);
    assert(buffer != NULL);
    uint32_t startAddress = address;
    status_t status       = kStatus_Success;

    for (uint32_t i = 0x00U; i <= (length / handle->bytesInPageSize); i++)
    {
        status = Nor_Flash_Page_Program(handle, startAddress, buffer);
        /* Avoid buffer overflow. */
        if (length >= handle->bytesInPageSize)
        {
            buffer += handle->bytesInPageSize;
            startAddress += handle->bytesInPageSize;
        }
    }

    return status;
}

status_t Nor_Flash_Erase_Sector(nor_handle_t *handle, uint32_t address)
{
    assert(handle != NULL);

    xspi_transfer_t flashXfer;
    bool isBusy     = true;
    status_t status = kStatus_Success;

    /* Write Enable. */
    if (XSPI_NOR_WriteEnable(handle, address) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    if (address >= s_socXspiAmbaBase[xspiInstanceId])
    {
        flashXfer.deviceAddress = address;
    }
    else
    {
        flashXfer.deviceAddress = s_socXspiAmbaBase[xspiInstanceId] + address;
    }
    flashXfer.cmdType         = kXSPI_Command;
    flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ERASESECTOR;
    flashXfer.data            = NULL;
    flashXfer.dataSize        = 0UL;
    flashXfer.targetGroup     = xspiMemNorHandle.selectedTg;
    flashXfer.lockArbitration = false;

    status = XSPI_TransferBlocking((XSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (status == kStatus_Success)
    {
        /* Loop until WIP is cleared  */
        do
        {
            (void)Nor_Flash_Is_Busy(handle, &isBusy);
        } while (isBusy == true);
    }

    return status;
}

status_t Nor_Flash_Erase_Block(nor_handle_t *handle, uint32_t address)
{
    assert(handle != NULL);

    xspi_transfer_t flashXfer;
    status_t status                            = kStatus_Success;
    xspi_mem_nor_handle_t *ptrXspiMemNorHandle = (xspi_mem_nor_handle_t *)(uint32_t)(handle->deviceSpecific);
    bool isBusy                                = false;

    /* Write Enable. */
    if (XSPI_NOR_WriteEnable(handle, address) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    if (address >= s_socXspiAmbaBase[xspiInstanceId])
    {
        flashXfer.deviceAddress = address;
    }
    else
    {
        flashXfer.deviceAddress = s_socXspiAmbaBase[xspiInstanceId] + address;
    }
    flashXfer.cmdType         = kXSPI_Command;
    flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK;
    flashXfer.data            = NULL;
    flashXfer.dataSize        = 0UL;
    flashXfer.targetGroup     = ptrXspiMemNorHandle->selectedTg;
    flashXfer.lockArbitration = false;

    status = XSPI_TransferBlocking((XSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (status == kStatus_Success)
    {
        /* Loop until WIP is cleared  */
        do
        {
            (void)Nor_Flash_Is_Busy(handle, &isBusy);
        } while (isBusy == false);
    }

