solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/xspi/fsl_xspi_nor_flash.c
    return status;
}

status_t Nor_Flash_Erase(nor_handle_t *handle, uint32_t address, uint32_t size_Byte)
{
    assert(handle != NULL);
    assert(size_Byte > 0x00U);
    uint32_t startAddress = address;
    status_t status       = kStatus_Success;

    for (uint32_t i = 0x00U; i <= (size_Byte / handle->bytesInSectorSize); i++)
    {
        status = Nor_Flash_Erase_Sector(handle, startAddress);
        startAddress += handle->bytesInSectorSize;
    }

    return status;
}

status_t Nor_Flash_Erase_Chip(nor_handle_t *handle)
{
    assert(handle != NULL);

    xspi_transfer_t flashXfer;
    status_t status                            = kStatus_Success;
    xspi_mem_nor_handle_t *ptrXspiMemNorHandle = (xspi_mem_nor_handle_t *)(uint32_t)(handle->deviceSpecific);
    bool isBusy                                = false;

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    /* Write Enable. */
    if (XSPI_NOR_WriteEnable(handle, s_socXspiAmbaBase[xspiInstanceId]) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
    flashXfer.cmdType         = kXSPI_Command;
    flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_CHIPERASE;
    flashXfer.data            = NULL;
    flashXfer.dataSize        = 0UL;
    flashXfer.targetGroup     = ptrXspiMemNorHandle->selectedTg;
    flashXfer.lockArbitration = false;

    status = XSPI_TransferBlocking((XSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (status == kStatus_Success)
    {
        /* Loop until WIP is cleared  */
        do
        {
            (void)Nor_Flash_Is_Busy(handle, &isBusy);
        } while (isBusy == false);
    }

    return status;
}

status_t Nor_Flash_Is_Busy(nor_handle_t *handle, bool *isBusy)
{
    assert(handle != NULL);

    xspi_transfer_t flashXfer;
    status_t status                            = kStatus_Success;
    xspi_mem_nor_handle_t *ptrXspiMemNorHandle = (xspi_mem_nor_handle_t *)(uint32_t)(handle->deviceSpecific);
    uint32_t readBuffer                        = 0UL;
    bool wip                                   = true;

    uint32_t xspiInstanceId = XSPI_GetInstance(curXSPIBase);

    flashXfer.deviceAddress   = s_socXspiAmbaBase[xspiInstanceId];
    flashXfer.cmdType         = kXSPI_Read;
    flashXfer.seqIndex        = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
    flashXfer.data            = &readBuffer;
    flashXfer.dataSize        = 2UL;
    flashXfer.targetGroup     = ptrXspiMemNorHandle->selectedTg;
    flashXfer.lockArbitration = false;

    status = XSPI_TransferBlocking((XSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (status == kStatus_Success)
    {
        /* Check if WIP is cleared. */
        if (ptrXspiMemNorHandle->norFlashStatusRegInfo.value1Expired)
        {
            wip =
                (((1U << ptrXspiMemNorHandle->norFlashStatusRegInfo.wipLocation) & readBuffer) != 0x0U) ? false : true;
        }
        else
        {
            wip =
                (((1U << ptrXspiMemNorHandle->norFlashStatusRegInfo.wipLocation) & readBuffer) != 0x0U) ? true : false;
        }

        *isBusy = wip;
    }

    return status;
}

status_t Nor_Flash_DeInit(nor_handle_t *handle)
{
    XSPI_Deinit((XSPI_Type *)handle->driverBaseAddr);

    return kStatus_Success;
}
